<a href="https://colab.research.google.com/github/Dikshya5058/AI-and-ML/blob/main/Untitled19.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [23]:
import pandas as pd

In [24]:
# 3.1-Problem_1

df = pd.read_csv("/content/drive/MyDrive/Week - 2 - Describing the World with Data/Dataset/bank.csv")

print(df.info())

obj_cols = df.select_dtypes(include='object').columns
print("Object Columns:", obj_cols)

for col in obj_cols:
    print("Unique values of", col, ":", df[col].unique())

print(df.isnull().sum())

numeric_df = df.select_dtypes(exclude='object')

numeric_df.to_csv("banknumericdata.csv", index=False)

new_df = pd.read_csv("banknumericdata.csv")
print(new_df.describe())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45211 entries, 0 to 45210
Data columns (total 17 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   age        45211 non-null  int64
 1   job        45211 non-null  object
 2   marital    45211 non-null  object
 3   education  45211 non-null  object
 4   default    45211 non-null  object
 5   balance    45211 non-null  int64
 6   housing    45211 non-null  object
 7   loan       45211 non-null  object
 8   contact    45211 non-null  object
 9   day        45211 non-null  int64
 10  month      45211 non-null  object
 11  duration   45211 non-null  int64
 12  campaign   45211 non-null  int64
 13  pdays      45211 non-null  int64
 14  previous   45211 non-null  int64
 15  poutcome   45211 non-null  object
 16  y          45211 non-null  object
dtypes: int64(7), object(10)
memory usage: 5.9+ MB
None
Object Columns: Index(['job', 'marital', 'education', 'default', 'housing', 'loan', 'contact',
       'month', 'poutcome', 'y'],
      dtype='object')
Unique values of job : ['management' 'technician' 'entrepreneur' 'blue-collar' 'unknown'
 'retired' 'admin.' 'services' 'self-employed' 'unemployed' 'housemaid'
 'student']
Unique values of marital : ['married' 'single' 'divorced']
Unique values of education : ['tertiary' 'secondary' 'unknown' 'primary']
Unique values of default : ['no' 'yes']
Unique values of housing : ['yes' 'no']
Unique values of loan : ['no' 'yes']
Unique values of contact : ['unknown' 'cellular' 'telephone']
Unique values of month : ['may' 'jun' 'jul' 'aug' 'oct' 'nov' 'dec' 'jan' 'feb' 'mar' 'apr' 'sep']
Unique values of poutcome : ['unknown' 'failure' 'other' 'success']
Unique values of y : ['no' 'yes']
age          0
job          0
marital      0
education    0
default      0
balance      0
housing      0
loan         0
contact      0
day          0
month        0
duration     0
campaign     0
pdays        0
previous     0
poutcome     0
y            0
dtype: int64
                age        balance           day      duration      campaign  \
count  45211.000000   45211.000000  45211.000000  45211.000000  45211.000000
mean      40.936210    1362.272058     15.806419    258.163080      2.763841
std       10.618762    3044.765829      8.322476    257.527812      3.098021
min       18.000000   -8019.000000      1.000000      0.000000      1.000000
25%       33.000000      72.000000      8.000000    103.000000      1.000000
50%       39.000000     448.000000     16.000000    180.000000      2.000000
75%       48.000000    1428.000000     21.000000    319.000000      3.000000
max       95.000000  102127.000000     31.000000   4918.000000     63.000000

              pdays      previous
count  45211.000000  45211.000000
mean      40.197828      0.580323
std      100.128746      2.303441
min       -1.000000      0.000000
25%       -1.000000      0.000000
50%       -1.000000      0.000000
75%       -1.000000      0.000000
max      871.000000    275.000000

In [25]:
# 3.1-Problem_2

df = pd.read_csv("/content/drive/MyDrive/Week - 2 - Describing the World with Data/Dataset/medical_students_dataset.csv")

df.info()
print(df.isnull().sum())

df['Age'] = df['Age'].fillna(df['Age'].mean())

df['Gender'] = df['Gender'].fillna(df['Gender'].mode()[0])
print(df.isnull().sum())

print("Number of duplicate rows:", df.duplicated().sum())

df = df.drop_duplicates()

print("Total rows after removing duplicates:", len(df))

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200000 entries, 0 to 199999
Data columns (total 13 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Student ID      180000 non-null  float64
 1   Age             180000 non-null  float64
 2   Gender          180000 non-null  object
 3   Height          180000 non-null  float64
 4   Weight          180000 non-null  float64
 5   Blood Type      180000 non-null  object
 6   BMI             180000 non-null  float64
 7   Temperature     180000 non-null  float64
 8   Heart Rate      180000 non-null  float64
 9   Blood Pressure  180000 non-null  float64
 10  Cholesterol     180000 non-null  float64
 11  Diabetes        180000 non-null  object
 12  Smoking         180000 non-null  object
dtypes: float64(9), object(4)
memory usage: 19.8+ MB
Student ID        20000
Age               20000
Gender            20000
Height            20000
Weight            20000
Blood Type        20000
BMI               20000
Temperature       20000
Heart Rate        20000
Blood Pressure    20000
Cholesterol       20000
Diabetes          20000
Smoking           20000
dtype: int64
Student ID        20000
Age                   0
Gender                0
Height            20000
Weight            20000
Blood Type        20000
BMI               20000
Temperature       20000
Heart Rate        20000
Blood Pressure    20000
Cholesterol       20000
Diabetes          20000
Smoking           20000
dtype: int64
Number of duplicate rows: 8506
Total rows after removing duplicates: 191494

In [26]:
# 3.2-Problem_1
df = pd.read_csv("/content/drive/MyDrive/Week - 2 - Describing the World with Data/Dataset/Titanic-Dataset.csv")

subset_df = df[['Name', 'Pclass', 'Sex', 'Age', 'Fare', 'Survived']]

first_class_df = subset_df[subset_df['Pclass'] == 1]

mean_fare = first_class_df['Fare'].mean()
median_fare = first_class_df['Fare'].median()
max_fare = first_class_df['Fare'].max()
min_fare = first_class_df['Fare'].min()

print("First-Class Fare Statistics:")
print("Mean Fare:", mean_fare)
print("Median Fare:", median_fare)
print("Maximum Fare:", max_fare)
print("Minimum Fare:", min_fare)

First-Class Fare Statistics:
Mean Fare: 84.1546875
Median Fare: 60.287499999999994
Maximum Fare: 512.3292
Minimum Fare: 0.0

In [27]:
# 3.2-Problem_2
df = pd.read_csv("/content/drive/MyDrive/Week - 2 - Describing the World with Data/Dataset/Titanic-Dataset.csv")

subset_df = df[['Name', 'Pclass', 'Sex', 'Age', 'Fare', 'Survived']]

first_class_df = subset_df[subset_df['Pclass'] == 1]

null_count = first_class_df['Age'].isnull().sum()
print("Number of null values in Age column:", null_count)

first_class_df_cleaned = first_class_df.dropna(subset=['Age'])

print("Rows after removing null Age values:", len(first_class_df_cleaned))

Number of null values in Age column: 30
Rows after removing null Age values: 186

In [28]:
# 3.2-Problem_3
df = pd.read_csv("/content/drive/MyDrive/Week - 2 - Describing the World with Data (1)/Dataset/Titanic-Dataset.csv")

encoded = pd.get_dummies(df['Embarked'], prefix='Embarked')

df = pd.concat([df, encoded], axis=1)

df = df.drop('Embarked', axis=1)

print(df.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin  Embarked_C  Embarked_Q  Embarked_S
0      0         A/5 21171   7.2500   NaN       False       False        True
1      0          PC 17599  71.2833   C85        True       False       False
2      0  STON/O2. 3101282   7.9250   NaN       False       False        True
3      0            113803  53.1000  C123       False       False        True
4      0            373450   8.0500   NaN       False       False        True